---
title: BuildingOperatingDaySchedule
classe: Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# BuildingOperatingDaySchedule

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String ScheduleName { get; set; }` | `buildingOperatingDaySchedule.ScheduleName` | String |
| `BuildingOperatingDaySchedule Create(Document, String)` | `BuildingOperatingDaySchedule.Create(document, name)` | BuildingOperatingDaySchedule |
| `Double GetValueForHour(Int32)` | `buildingOperatingDaySchedule.GetValueForHour(hour)` | Double |
| `Void SetValueForHour(Int32, Double)` | `buildingOperatingDaySchedule.SetValueForHour(hour, usage)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```